In [1]:
import pandas as pd
from sklearn import linear_model

In [2]:
df = pd.read_csv("excercise2.csv")

In [3]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [6]:
df['experience'].fillna('zero', inplace=True)

In [7]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [13]:
df.rename(columns={'test_score(out of 10)':'test_score', 'interview_score(out of 10)': 'interview_score'}, inplace=True)
df

  experience  test_score  interview_score  salary($)
0       zero         8.0                9      50000
1       zero         8.0                6      45000
2       five         6.0                7      60000
3        two        10.0               10      65000
4      seven         9.0                6      70000
5      three         7.0               10      62000
6        ten         NaN                7      72000
7     eleven         7.0                8      80000

In [15]:
def parse_int(textnum):
    units = ["zero", "one", "two", "three", "four", "five", "six", "seven", "eight",
        "nine", "ten", "eleven", "twelve", "thirteen", "fourteen", "fifteen"]
    words_and_num = list(enumerate(units))
    
    if textnum not in units:
        print("Illegal Input!!!")
        
    else:
        for num, word in words_and_num:
            if word == textnum:
                return num

In [20]:
parse_check = parse_int("fourteen")

In [21]:
parse_check

14

In [27]:
wordnum_set = set()
for row in df.values:
    wordnum_set.add(row[0])
wordnum_set

{'eleven', 'five', 'seven', 'ten', 'three', 'two', 'zero'}

In [28]:
for word in wordnum_set:
    df.replace(word, parse_int(word), inplace=True)

In [29]:
df

   experience  test_score  interview_score  salary($)
0           0         8.0                9      50000
1           0         8.0                6      45000
2           5         6.0                7      60000
3           2        10.0               10      65000
4           7         9.0                6      70000
5           3         7.0               10      62000
6          10         NaN                7      72000
7          11         7.0                8      80000

In [36]:
median_test_score = df.test_score.median()
df['test_score'].fillna(median_test_score, inplace=True)
df

   experience  test_score  interview_score  salary($)
0           0         8.0                9      50000
1           0         8.0                6      45000
2           5         6.0                7      60000
3           2        10.0               10      65000
4           7         9.0                6      70000
5           3         7.0               10      62000
6          10         8.0                7      72000
7          11         7.0                8      80000

In [37]:
reg = linear_model.LinearRegression()

In [38]:
reg.fit(df[['experience', 'test_score', 'interview_score']], df['salary($)'])

LinearRegression()

In [39]:
reg.predict([[1, 7, 8]])

array([51112.08151383])

In [41]:
reg.coef_

array([2812.95487627, 1845.70596798, 2205.24017467])

In [42]:
reg.intercept_

17737.26346433768